Autodesk.Revit.DB.RevitLinkLoadResultType
Enum listing the possible results after loading a linked model.
Remarks:
For all values except LinkLoadResultType.LinkLoaded, the linked model
is not loaded and no new link is created (if Revit was trying to create a link).
Since:
2013
Since:
2013

Autodesk.Revit.DB.RevitLinkLoadResultType.LinkExists
The linked model which Revit is trying to load is using a path that is already being used by a different RvtLinkSymbol.

Autodesk.Revit.DB.RevitLinkLoadResultType.ExternalServerMissing
The external add-in required to load this link model could not be found.

Autodesk.Revit.DB.RevitLinkLoadResultType.LinkMayBeUpgraded
Point cloud link loaded correctly but is obsolete and may be upgraded.

Autodesk.Revit.DB.RevitLinkLoadResultType.LinkNotLoadedOtherError
An unknown error occurred.

Autodesk.Revit.DB.RevitLinkLoadResultType.SameCentralModelAsHost
Either the linked model and its host document are both locals of the same
central model, or one is a local and the other is its central.

Autodesk.Revit.DB.RevitLinkLoadResultType.SameModelAsHost
The linked model has the same path as the currently active document.

Autodesk.Revit.DB.RevitLinkLoadResultType.LinkOpenAsHost
The linked model is already opened directly in Revit.

Autodesk.Revit.DB.RevitLinkLoadResultType.LinkNotOpenable
An error occurred trying to read the linked model.

Autodesk.Revit.DB.RevitLinkLoadResultType.LinkNotFound
The linked model could not be found.

Autodesk.Revit.DB.RevitLinkLoadResultType.LinkLoaded
The linked model loaded correctly.

Autodesk.Revit.DB.RevitLinkLoadResultType.Uninitialized
Revit has not tried to load the link, possibly because it is a nested
link and its parent failed to load.